## Plan output for service config

```

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.system.docker_image.otel has been deleted
  - resource "docker_image" "otel" {
        id            = "sha256:2104a98ea03e171255585494b787c2a92722b74a85dcb129872d3f080e66a9c8public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1"
      - name          = "public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1" -> null
        # (4 unchanged attributes hidden)
    }

  # module.system.docker_registry_image.otel has been deleted
  - resource "docker_registry_image" "otel" {
        id                   = "sha256:473f0b6ffbdf63f053e22e56e8db78b2c1cd7feec3902eaa93305b699c0dbc09"
      - name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.exporter.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:b17944ef5f071da931c7c49aa89d9192beb8c22829e648fa05ba0baa424fb8b6207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.tools.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:5c1b7060638a52b8cf445650230db2105ba7e38bae00c7beb7a33f3dd11c1412207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.consumer.module.task.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:7fde72ccc5b8dd4692798438d82934f868f262674fffe8feba470fd9fa153ebc207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.system.module.redoer.module.task.docker_image.container has been deleted
  - resource "docker_image" "container" {
      - id       = "sha256:45b844920f86ae70b5bfcdd818c3745b46f64527cf155c8f343cd72deed4f395207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
      - name     = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.system.aws_cloudwatch_event_target.exporter will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "exporter" {
        id             = "sqs-senzing-development-queue-empty-export-export"
        # (7 unchanged attributes hidden)

      ~ ecs_target {
            tags                    = {}
          ~ task_definition_arn     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter:31" -> (known after apply)
            # (5 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.system.aws_iam_role_policy.eventbridge will be updated in-place
  ~ resource "aws_iam_role_policy" "eventbridge" {
        id     = "sqs-senzing-development-eventbridge-run-task:sqs-senzing-development-eventbridge-run-task"
        name   = "sqs-senzing-development-eventbridge-run-task"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:RunTask",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter:31",
                        ]
                      - Sid      = "RunTask"
                    },
                  - {
                      - Action   = [
                          - "iam:PassRole",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::207495628382:role/sqs-senzing-development-exporter-execution",
                          - "arn:aws:iam::207495628382:role/sqs-senzing-development-exporter-task",
                        ]
                      - Sid      = "PassRoles"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.system.docker_image.otel will be created
  + resource "docker_image" "otel" {
      + id            = (known after apply)
      + image_id      = (known after apply)
      + name          = "public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1"
      + platform      = "linux/amd64"
      + pull_triggers = [
          + "sha256:4eabdc3213c7897d12df8daa4b8f1bf2fd3ebffc72ccdb8279102169a932342e",
        ]
      + repo_digest   = (known after apply)
    }

  # module.system.docker_registry_image.otel will be created
  + resource "docker_registry_image" "otel" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "digest" = "sha256:4eabdc3213c7897d12df8daa4b8f1bf2fd3ebffc72ccdb8279102169a932342e"
        }

      + auth_config {
          + address  = "https://207495628382.dkr.ecr.us-west-1.amazonaws.com"
          + password = (sensitive value)
          + username = "AWS"
        }
    }

  # module.system.docker_tag.otel must be replaced
+/- resource "docker_tag" "otel" {
      ~ id              = "public.ecr.aws/aws-observability/aws-otel-collector:v0.45.1.207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-otel:v0.45.1" -> (known after apply)
      ~ source_image_id = "sha256:2104a98ea03e171255585494b787c2a92722b74a85dcb129872d3f080e66a9c8" -> (known after apply)
      ~ tag_triggers    = [ # forces replacement
          - "2025-11-07T21:40:12Z",
          - "sha256:4eabdc3213c7897d12df8daa4b8f1bf2fd3ebffc72ccdb8279102169a932342e",
        ] -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.system.module.exporter.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "9ae8856d9200ec4b165e6b9555165b64cc49b794"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.exporter.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = "https://207495628382.dkr.ecr.us-west-1.amazonaws.com"
          + password = (sensitive value)
          + username = "AWS"
        }
    }

  # module.system.module.tools.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "9ae8856d9200ec4b165e6b9555165b64cc49b794"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.tools.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = "https://207495628382.dkr.ecr.us-west-1.amazonaws.com"
          + password = (sensitive value)
          + username = "AWS"
        }
    }

  # module.system.module.consumer.module.service.aws_ecs_service.main_ignore_desired_count_changes[0] will be updated in-place
  ~ resource "aws_ecs_service" "main_ignore_desired_count_changes" {
        id                                 = "arn:aws:ecs:us-west-1:207495628382:service/sqs-senzing-development/sqs-senzing-development-consumer"
        name                               = "sqs-senzing-development-consumer"
        tags                               = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-consumer:34" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.system.module.consumer.module.task.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "9ae8856d9200ec4b165e6b9555165b64cc49b794"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.consumer.module.task.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = "https://207495628382.dkr.ecr.us-west-1.amazonaws.com"
          + password = (sensitive value)
          + username = "AWS"
        }
    }

  # module.system.module.exporter.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter:31" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-exporter" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints            = []
                    name                   = "otel-collector"
                  - portMappings           = []
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
              ~ {
                  ~ image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-exporter:9ae8856d9200ec4b165e6b9555165b64cc49b794"
                    name                   = "sqs-senzing-development-exporter"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "sqs-senzing-development-exporter" -> (known after apply)
      ~ revision                 = 31 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

  # module.system.module.redoer.module.service.aws_ecs_service.main_ignore_desired_count_changes[0] will be updated in-place
  ~ resource "aws_ecs_service" "main_ignore_desired_count_changes" {
        id                                 = "arn:aws:ecs:us-west-1:207495628382:service/sqs-senzing-development/sqs-senzing-development-redoer"
        name                               = "sqs-senzing-development-redoer"
        tags                               = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
      ~ task_definition                    = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-redoer:17" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.system.module.redoer.module.task.docker_image.container will be created
  + resource "docker_image" "container" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + repo_digest = (known after apply)
      + triggers    = {
          + "image_tage" = "9ae8856d9200ec4b165e6b9555165b64cc49b794"
        }

      + build {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.system.module.redoer.module.task.docker_registry_image.container will be created
  + resource "docker_registry_image" "container" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:9ae8856d9200ec4b165e6b9555165b64cc49b794"
      + sha256_digest        = (known after apply)
      + triggers             = (known after apply)

      + auth_config {
          + address  = "https://207495628382.dkr.ecr.us-west-1.amazonaws.com"
          + password = (sensitive value)
          + username = "AWS"
        }
    }

  # module.system.module.tools.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-tools:80" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-tools" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints            = []
                    name                   = "otel-collector"
                  - portMappings           = []
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
              ~ {
                  ~ image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-tools:9ae8856d9200ec4b165e6b9555165b64cc49b794"
                    name                   = "sqs-senzing-development-tools"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "sqs-senzing-development-tools" -> (known after apply)
      ~ revision                 = 80 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "aws-lib" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "aws-lib"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

  # module.system.module.consumer.module.task.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-consumer:34" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-consumer" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints            = []
                    name                   = "otel-collector"
                  - portMappings           = []
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
              ~ {
                  ~ image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-consumer:9ae8856d9200ec4b165e6b9555165b64cc49b794"
                    name                   = "sqs-senzing-development-consumer"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "sqs-senzing-development-consumer" -> (known after apply)
      ~ revision                 = 34 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

  # module.system.module.redoer.module.task.module.ecs_task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-redoer:17" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:207495628382:task-definition/sqs-senzing-development-redoer" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints            = []
                    name                   = "otel-collector"
                  - portMappings           = []
                  - systemControls         = []
                  - volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
              ~ {
                  ~ image                  = "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> "207495628382.dkr.ecr.us-west-1.amazonaws.com/sqs-senzing-development-redoer:9ae8856d9200ec4b165e6b9555165b64cc49b794"
                    name                   = "sqs-senzing-development-redoer"
                  ~ portMappings           = [
                      ~ {
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls         = []
                  - volumesFrom            = []
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "sqs-senzing-development-redoer" -> (known after apply)
      ~ revision                 = 17 -> (known after apply)
        tags                     = {
            "awsApplication" = "arn:aws:resource-groups:us-west-1:207495628382:group/sqs-senzing-development/0949oli7hmptcuydpbudaxsl9k"
        }
        # (12 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "logs" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "senzing-home" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "logs"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "senzing-home"
        }
    }

Plan: 15 to add, 4 to change, 5 to destroy.

Changes to Outputs:
  ~ image_tag              = "fd4d11f6b63a0ccef031e57d4e0689ffb3a5296a" -> "9ae8856d9200ec4b165e6b9555165b64cc49b794"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```